---
kind: method
id: M:Autodesk.Revit.DB.Document.GetDocumentPreviewSettings
zh: 文档、文件
source: html/ab0a9756-1ee1-df01-f8ef-10f7fbdec80f.htm
---
# Autodesk.Revit.DB.Document.GetDocumentPreviewSettings Method

**中文**: 文档、文件

Returns the preview settings for the given document.

## Syntax (C#)
```csharp
public DocumentPreviewSettings GetDocumentPreviewSettings()
```

## Returns
The preview settings.